/*
任务描述
本关任务：编写函数求区间[200,3000]中所有的回文数，回文数是正读和反读都是一样的数。如525, 1551
无需输入
输出
输出区间[200,3000]中所有的回文数，一行一个回文数，不需要输出其它无关的字符。
202
212
222
232
242
.....
*/
#include<stdio.h>
void solve(){
	int i,a,c,x,y,z,w;
    for(i=200;i<=999;i++){
    	a=i/100;
    	c=i%100%10;
    	if(a==c){
    		printf("%d\n",i);
		}
	}
	for(i=1000;i<=3000;i++){
		x=i/1000;
		y=i%1000/100;
		z=i%1000%100/10;
		w=i%1000%100%10;
		if(x==w && y==z){
			printf("%d\n",i); 
		}
	}
}
int main(void)
{  
    solve();
   return 0;
}
