/* 
任务描述
题目描述:有如下表达式 s = 1 + 1 / 3 + (1 * 2) / (3 * 5) + (1 * 2 * 3) / (3 * 5 * 7) + .... + (1 * 2 * 3 * .... * n) / (3 * 5 * 7 * ... * (2 * n + 1))。
编写函数求给出的n所对应的表达式s的值。  
输入
一个整数n
输出
输出表达式的值,保留小数点后10位的值。  
样例输入：
4
样例输出：
1.5492063492
*/
#include<stdio.h>
void fun(int n){
	int i;
	double s=1.000,a=1.000,b=1.000,c;
	for(i=1;i<=n;i++){
		a*=i;
		b=b*(2*i+1);
		c=a/b;
		s+=c;
	}
	printf("%.10f",s);
	
} 
int main(void)
{  
    int n;
	scanf("%d",&n);
	fun(n);
    return 0;
}
